In [47]:
import numpy as np
import pandas as pd

SERIES

In [48]:
s = pd.Series([20, 40, 80, 50, 50, 80, 50])

In [49]:
s.sum()

np.int64(370)

In [50]:
s.max()

np.int64(80)

MEASURE OF CENTER TENDENCY

In [51]:
s.min()

np.int64(20)

In [52]:
s.mean()

np.float64(52.857142857142854)

In [53]:
s.median()

np.float64(50.0)

MEASURE OF SPREAD

In [54]:
s.std()

np.float64(21.38089935299395)

In [55]:
s.var()

np.float64(457.14285714285717)

In [56]:
s.value_counts()

50    3
80    2
40    1
20    1
Name: count, dtype: int64

In [57]:
s.index

RangeIndex(start=0, stop=7, step=1)

In [58]:
s.values

array([20, 40, 80, 50, 50, 80, 50])

DATAFRAME

In [59]:
student_data = pd.DataFrame({
    "name"      : ['AMAN', 'ANIL', 'AMAN', 'VINIT', 'MAHESH'],
    "age"       : [20, 21, 20, 22, 21],
    "physics"   : [10, 91, 60, 70, 80],
    "chimistry" : [20, 30, 50, 45, 35],
    "maths"     : [40, 52, 56, 60, 50]
})

In [60]:
student_data

     name  age  physics  chimistry  maths
0    AMAN   20       10         20     40
1    ANIL   21       91         30     52
2    AMAN   20       60         50     56
3   VINIT   22       70         45     60
4  MAHESH   21       80         35     50

In [61]:
student_data['total'] = student_data['physics'] + student_data['chimistry'] + student_data['maths']

In [62]:
student_data['percentage'] = round(student_data.total / 3, ndigits=2)

In [63]:
student_data.sort_values(by = 'percentage', ascending= False, inplace= True, ignore_index= True )

In [64]:
student_data

     name  age  physics  chimistry  maths  total  percentage
0   VINIT   22       70         45     60    175       58.33
1    ANIL   21       91         30     52    173       57.67
2    AMAN   20       60         50     56    166       55.33
3  MAHESH   21       80         35     50    165       55.00
4    AMAN   20       10         20     40     70       23.33

In [65]:
def give_grades(percent):
    if percent < 33:
        return "F"
    
    elif percent < 50:
        return "C"
    
    elif percent < 60:
        return "B"
    
    elif percent < 90:
        return "A"
    
    else:
        return "A+"

In [66]:
student_data['grades'] = student_data['percentage'].apply(func= give_grades)

In [67]:
# BOOLEAN INDEXING

In [68]:
# find out names of those whose age is more than 21
# find out data of those who got failed
# find out those who got grade a or a+

In [69]:
student_data[student_data['maths'] > 55]

    name  age  physics  chimistry  maths  total  percentage grades
0  VINIT   22       70         45     60    175       58.33      B
2   AMAN   20       60         50     56    166       55.33      B

In [70]:
student_data[(student_data['physics'] > 55) & (student_data['physics'] < 75)]

    name  age  physics  chimistry  maths  total  percentage grades
0  VINIT   22       70         45     60    175       58.33      B
2   AMAN   20       60         50     56    166       55.33      B

In [71]:
#identify people who scored well in maths but not so good in physics
# maths > 50  , physics < 60   
# student_data['maths']  > 50
# student_data['physics'] < 60

#bitwise and - > &  (ampersand)
#bitwise or ->  | 
#bitwise not ->  ~ (tilde)


student_data[ (student_data['chimistry'] > 40)  & ( student_data[ 'maths' ] < 45) ]["name"]

Series([], Name: name, dtype: object)

In [ ]:
# student_data

#what basic operation you can do on a table?

#DELETE COLUMN 
# del student_data['grades']
# student_data.drop(columns=['total', 'percentage'], inplace = True)

#RENAME COLUMN
# student_data.rename(columns={"physics": "bio", 'chimistry' : 'chemistry'}, inplace= True)
# student_data['bio'] = student_data['bio'].astype(dtype='float')


#CHNGE DATA TYPE
# student_data['bio'] = student_data['bio'].astype(dtype='float')

# DELTE ROWS VIA INDEXING
# student_data.drop(labels=[1,3])


#DELETE ROWS VIA CONDITION
# student_data.drop(student_data[student_data['maths']  > 55].index)

In [75]:
student_data.rename(columns={"physics": "bio", 'chimistry' : 'chemistry'}, inplace= True)

In [81]:
student_data['bio'] = student_data['bio'].astype(dtype='float')

In [86]:
student_data['name'] = student_data['name'].astype(dtype= 'str')

In [ ]:
student_data.drop(labels=[1,3])

    name  age   bio  chemistry  maths  total  percentage grades
0  VINIT   22  70.0         45     60    175       58.33      B
2   AMAN   20  60.0         50     56    166       55.33      B
4   AMAN   20  10.0         20     40     70       23.33      F

In [ ]:
student_data =student_data[~(student_data['grades'] == 'F')]

     name  age   bio  chemistry  maths  total  percentage grades
0   VINIT   22  70.0         45     60    175       58.33      B
1    ANIL   21  91.0         30     52    173       57.67      B
2    AMAN   20  60.0         50     56    166       55.33      B
3  MAHESH   21  80.0         35     50    165       55.00      B

In [99]:
student_data

     name  age   bio  chemistry  maths  total  percentage grades
0   VINIT   22  70.0         45     60    175       58.33      B
1    ANIL   21  91.0         30     52    173       57.67      B
2    AMAN   20  60.0         50     56    166       55.33      B
3  MAHESH   21  80.0         35     50    165       55.00      B
4    AMAN   20  10.0         20     40     70       23.33      F

In [109]:
student_data.drop(student_data[student_data['maths']  > 55].index)

     name  age   bio  chemistry  maths  total  percentage grades
1    ANIL   21  91.0         30     52    173       57.67      B
3  MAHESH   21  80.0         35     50    165       55.00      B
4    AMAN   20  10.0         20     40     70       23.33      F

In [107]:
student_data[student_data['grades']  == 'F'].index

Index([4], dtype='int64')

In [126]:
# dataframe.loc[row_slicing , columns names]

student_data.loc[1,  : : ]  = ['ANIL SHARMA', 22, 94, 40, 52, 175, 60, 'A' ]

In [ ]:
student_data.loc[2:3, ['chemistry', 'maths', 'total']] = [[1,2, 3],[4, 5, 6]]

In [133]:
student_data.loc[student_data['total'] > 100, 'maths'] = [[50],[70]]

In [134]:
student_data

          name  age   bio  chemistry  maths  total  percentage grades
0        VINIT   22  70.0         45     50    175       58.33      B
1  ANIL SHARMA   22  94.0         40     70    175       60.00      A
2         AMAN   20  60.0          1      2      3       55.33      B
3       MAHESH   21  80.0          4      5      6       55.00      B
4         AMAN   20  10.0         20     40     70       23.33      F

In [139]:
student_data.iloc[ 0:3, -2 : : ]

   percentage grades
0       58.33      B
1       60.00      A
2       55.33      B

In [143]:
df = pd.DataFrame({
    'OrderID': [101, 102],
    'Customer': ['Zomato', 'Swiggy'],
    'TotalBill': [250, 300]
})
df

   OrderID Customer  TotalBill
0      101   Zomato        250
1      102   Swiggy        300

In [151]:
df.loc[len(df)] = [103, 'Blinkit', 500]

In [156]:
df1 = pd.DataFrame({
    "name" : ["a", "b"], 
    "age"  : [20, 21]
}
)
df1

  name  age
0    a   20
1    b   21

In [157]:
df2 = pd.DataFrame({
    "name" : ["c", "d"], 
    "age"  : [22, 23]
}
)
df2

  name  age
0    c   22
1    d   23

In [159]:
pd.concat([df1, df2], ignore_index= True)

  name  age
0    a   20
1    b   21
2    c   22
3    d   23